update causal docs.
